GNU gdb (GDB) Fedora 8.3-7.fc30
Copyright (C) 2019 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from explicitMatrix...
(gdb) watch RG[9].isEquil
Hardware watchpoint 1: RG[9].isEquil
(gdb) r
Starting program: /home/guidry/mwg/research/FERN_C++/Thermo-nuclear-network/explicitMatrix/explicitMatrix 
Missing separate debuginfos, use: dnf debuginfo-install glibc-2.29-28.fc30.x86_64

Hardware watchpoint 1: RG[9].isEquil

Old value = <unreadable>
New value = false
main () at explicitMatrix.cpp:4090
4090	    assignRG();
Missing separate debuginfos, use: dnf debuginfo-install libgcc-9.2.1-1.fc30.x86_64 libstdc++-9.2.1-1.fc30.x86_64
(gdb) p t
$1 = 0
(gdb) c
Continuing.

Fri Jun  3 15:55:22 2022


Integration using ASY+PE method
T9=7.000e+00 rho=1.000e+08 massTol=5.000e-03 sf=1.00e+25 equiTol=1.00e-02 equilTime=1.00e-12
maxit=20 downbumper= 0.700 EpsA=5.00e-03 EpsR=2.00e-04
Network: data/network_alpha.inp  Rates: data/rateLibrary_alpha.data
Integration steps=0  totalIterations=0  IntegrationSteps_plotted=0
Timer: 6.7580e+00 ms used

BEGIN TIME INTEGRATION:

1 it=0 t=1.35e-18 dt=1.35e-19 int=55 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.22e+10 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
2 it=0 t=1.80e-18 dt=1.80e-19 int=58 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.96e+10 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
3 it=0 t=2.17e-18 dt=2.17e-19 int=60 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.58e+10 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
4 it=0 t=2.89e-18 dt=2.89e-19 int=63 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.77e+10 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
5 it=0 t=3.85e-18 dt=3.85e-19 int=66 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.36e+10 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
6 it=0 t=4.66e-18 dt=4.66e-19 int=68 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.70e+10 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
7 it=0 t=6.20e-18 dt=6.20e-19 int=71 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.02e+11 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
8 it=0 t=8.26e-18 dt=8.26e-19 int=74 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.36e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
9 it=0 t=9.99e-18 dt=9.99e-19 int=76 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.65e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
10 it=0 t=1.33e-17 dt=1.33e-18 int=79 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.20e+11 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
11 it=0 t=1.77e-17 dt=1.77e-18 int=82 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.93e+11 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
12 it=0 t=2.14e-17 dt=2.14e-18 int=84 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.54e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
13 it=0 t=2.85e-17 dt=2.85e-18 int=87 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.72e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
14 it=0 t=3.79e-17 dt=3.79e-18 int=90 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.28e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
15 it=0 t=4.59e-17 dt=4.59e-18 int=92 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.59e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
16 it=0 t=6.11e-17 dt=6.11e-18 int=95 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.01e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
17 it=0 t=8.13e-17 dt=8.13e-18 int=98 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.35e+12 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
18 it=0 t=9.84e-17 dt=9.84e-18 int=100 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.63e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
19 it=0 t=1.31e-16 dt=1.31e-17 int=103 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.17e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
20 it=0 t=1.74e-16 dt=1.74e-17 int=106 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.88e+12 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
21 it=0 t=2.11e-16 dt=2.11e-17 int=108 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.49e+12 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
22 it=0 t=2.81e-16 dt=2.81e-17 int=111 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.65e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
23 it=0 t=3.40e-16 dt=3.40e-17 int=113 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=5.62e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
24 it=0 t=4.52e-16 dt=4.52e-17 int=116 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.48e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
25 it=0 t=6.02e-16 dt=6.02e-17 int=119 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=9.96e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
26 it=0 t=7.28e-16 dt=7.28e-17 int=121 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.20e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
27 it=0 t=9.69e-16 dt=9.69e-17 int=124 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.60e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
28 it=0 t=1.29e-15 dt=1.29e-16 int=127 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.13e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
29 it=0 t=1.56e-15 dt=1.56e-16 int=129 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.58e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
30 it=0 t=2.08e-15 dt=2.08e-16 int=132 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.44e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
31 it=0 t=2.77e-15 dt=2.77e-16 int=135 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.57e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
32 it=0 t=3.35e-15 dt=3.35e-16 int=137 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=5.53e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
33 it=0 t=4.45e-15 dt=4.45e-16 int=140 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.36e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
34 it=0 t=5.93e-15 dt=5.93e-16 int=143 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=9.80e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
35 it=0 t=7.17e-15 dt=7.17e-16 int=145 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.19e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
36 it=0 t=9.55e-15 dt=9.55e-16 int=148 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.58e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
37 it=0 t=1.27e-14 dt=1.27e-15 int=151 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.10e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
38 it=0 t=1.54e-14 dt=1.54e-15 int=153 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.54e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
39 it=0 t=2.05e-14 dt=2.05e-15 int=156 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=3.37e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
40 it=0 t=2.72e-14 dt=2.72e-15 int=159 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=4.49e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
41 it=0 t=3.30e-14 dt=3.30e-15 int=161 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=5.42e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
42 it=0 t=4.39e-14 dt=4.39e-15 int=164 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.63e+28 E=7.20e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
43 it=0 t=5.84e-14 dt=5.84e-15 int=167 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.62e+28 E=9.57e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
44 it=0 t=7.06e-14 dt=7.06e-15 int=169 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.62e+28 E=1.16e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
45 it=0 t=9.40e-14 dt=9.40e-15 int=172 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.60e+28 E=1.53e+15 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
46 it=0 t=1.25e-13 dt=1.25e-14 int=175 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.59e+28 E=2.03e+15 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
47 it=0 t=1.51e-13 dt=1.51e-14 int=177 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.58e+28 E=2.44e+15 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
48 it=0 t=2.02e-13 dt=2.02e-14 int=180 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.55e+28 E=3.22e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
49 it=0 t=2.68e-13 dt=2.68e-14 int=183 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.52e+28 E=4.24e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
50 it=0 t=3.25e-13 dt=3.25e-14 int=185 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.49e+28 E=5.09e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
51 it=0 t=4.32e-13 dt=4.32e-14 int=188 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.44e+28 E=6.65e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
52 it=0 t=5.75e-13 dt=5.75e-14 int=191 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.38e+28 E=8.66e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
53 it=0 t=6.96e-13 dt=6.96e-14 int=193 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.33e+28 E=1.03e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
54 it=0 t=9.26e-13 dt=9.26e-14 int=196 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.24e+28 E=1.32e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
Hardware watchpoint 1: RG[9].isEquil

Old value = false
New value = true
ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
3247	        for (int i = 0; i < niso; i++) {
(gdb) p t
$2 = 1.0188104496101148e-12
(gdb) backtrace
#0  ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
#1  0x000000000040cbef in ReactionGroup::computeQuad (this=0x486e30) at explicitMatrix.cpp:3180
#2  0x000000000040bd1e in ReactionGroup::computeEquilibrium (this=0x486e30) at explicitMatrix.cpp:2920
#3  0x000000000040313c in main () at explicitMatrix.cpp:4292
(gdb) p RGn
$3 = 9
(gdb) p i
$4 = 0
(gdb) p isEquil
$5 = true
(gdb) c
Continuing.

Hardware watchpoint 1: RG[9].isEquil

Old value = true
New value = false
ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
3247	        for (int i = 0; i < niso; i++) {
(gdb) backtrace
#0  ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
#1  0x000000000040cbef in ReactionGroup::computeQuad (this=0x486e30) at explicitMatrix.cpp:3180
#2  0x000000000040bd1e in ReactionGroup::computeEquilibrium (this=0x486e30) at explicitMatrix.cpp:2920
#3  0x000000000040313c in main () at explicitMatrix.cpp:4292
(gdb) p i
$6 = 0
(gdb) c
Continuing.

Hardware watchpoint 1: RG[9].isEquil

Old value = false
New value = true
ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
3247	        for (int i = 0; i < niso; i++) {
(gdb) p t
$7 = 1.1206914945711264e-12
(gdb) p i
$8 = 0
(gdb) c
Continuing.

Hardware watchpoint 1: RG[9].isEquil

Old value = true
New value = false
ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
3247	        for (int i = 0; i < niso; i++) {
(gdb) p t
$9 = 1.1206914945711264e-12
(gdb) c
Continuing.

Hardware watchpoint 1: RG[9].isEquil

Old value = false
New value = true
ReactionGroup::computeEqRatios (this=0x486e30) at explicitMatrix.cpp:3247
3247	        for (int i = 0; i < niso; i++) {
(gdb) p t
$10 = 1.2327606440282391e-12
(gdb) info b
Num     Type           Disp Enb Address            What
1       hw watchpoint  keep y                      RG[9].isEquil
	breakpoint already hit 6 times
(gdb) d 1
(gdb) 