GNU gdb (GDB) Fedora 8.3-7.fc30
Copyright (C) 2019 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from explicitMatrix...
(gdb) watch Y[7] if t>2.5e-9 && dtMode==-1
Hardware watchpoint 1: Y[7]
(gdb) commands
Type commands for breakpoint(s) 1, one per line.
End with a line saying just "end".
>printf"\ngnu: steps=%d logt=%7.6f logY[7]=%7.6f equil= %d\n",totalTimeSteps,(double)log10(t_saved+dt_saved),(double)log10(Y[7]),totalEquilRG
>end
(gdb) r
Starting program: /home/guidry/mwg/research/FERN_C++/Thermo-nuclear-network/explicitMatrix/explicitMatrix 
Missing separate debuginfos, use: dnf debuginfo-install glibc-2.29-28.fc30.x86_64

Mon Jun  6 14:25:33 2022


Integration using ASY+PE method
T9=7.000e+00 rho=1.000e+08 massTol=5.000e-03 sf=1.00e+25 equiTol=1.00e-02 equilTime=1.00e-12
maxit=20 downbumper= 0.700 EpsA=5.00e-03 EpsR=2.00e-04
Network: data/network_alpha.inp  Rates: data/rateLibrary_alpha.data
Integration steps=0  totalIterations=0  IntegrationSteps_plotted=0
Timer: 6.2830e+00 ms used

BEGIN TIME INTEGRATION:

1 it=0 t=1.35e-18 dt=1.35e-19 int=55 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.22e+10 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
2 it=0 t=1.80e-18 dt=1.80e-19 int=58 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.96e+10 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
3 it=0 t=2.17e-18 dt=2.17e-19 int=60 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.58e+10 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
4 it=0 t=2.89e-18 dt=2.89e-19 int=63 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.77e+10 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
5 it=0 t=3.85e-18 dt=3.85e-19 int=66 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.36e+10 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
6 it=0 t=4.66e-18 dt=4.66e-19 int=68 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.70e+10 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
7 it=0 t=6.20e-18 dt=6.20e-19 int=71 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.02e+11 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
8 it=0 t=8.26e-18 dt=8.26e-19 int=74 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.36e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
9 it=0 t=9.99e-18 dt=9.99e-19 int=76 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.65e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
10 it=0 t=1.33e-17 dt=1.33e-18 int=79 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.20e+11 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
11 it=0 t=1.77e-17 dt=1.77e-18 int=82 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.93e+11 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
12 it=0 t=2.14e-17 dt=2.14e-18 int=84 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.54e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
13 it=0 t=2.85e-17 dt=2.85e-18 int=87 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.72e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
14 it=0 t=3.79e-17 dt=3.79e-18 int=90 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=6.28e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
15 it=0 t=4.59e-17 dt=4.59e-18 int=92 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.59e+11 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
16 it=0 t=6.11e-17 dt=6.11e-18 int=95 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.01e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
17 it=0 t=8.13e-17 dt=8.13e-18 int=98 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.35e+12 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
18 it=0 t=9.84e-17 dt=9.84e-18 int=100 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.63e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
19 it=0 t=1.31e-16 dt=1.31e-17 int=103 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.17e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
20 it=0 t=1.74e-16 dt=1.74e-17 int=106 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.88e+12 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
21 it=0 t=2.11e-16 dt=2.11e-17 int=108 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.49e+12 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
22 it=0 t=2.81e-16 dt=2.81e-17 int=111 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.65e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
23 it=0 t=3.40e-16 dt=3.40e-17 int=113 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=5.62e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
24 it=0 t=4.52e-16 dt=4.52e-17 int=116 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.48e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
25 it=0 t=6.02e-16 dt=6.02e-17 int=119 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=9.96e+12 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
26 it=0 t=7.28e-16 dt=7.28e-17 int=121 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.20e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
27 it=0 t=9.69e-16 dt=9.69e-17 int=124 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.60e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
28 it=0 t=1.29e-15 dt=1.29e-16 int=127 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.13e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
29 it=0 t=1.56e-15 dt=1.56e-16 int=129 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.58e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
30 it=0 t=2.08e-15 dt=2.08e-16 int=132 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=3.44e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
31 it=0 t=2.77e-15 dt=2.77e-16 int=135 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=4.57e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
32 it=0 t=3.35e-15 dt=3.35e-16 int=137 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=5.53e+13 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
33 it=0 t=4.45e-15 dt=4.45e-16 int=140 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=7.36e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
34 it=0 t=5.93e-15 dt=5.93e-16 int=143 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=9.80e+13 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
35 it=0 t=7.17e-15 dt=7.17e-16 int=145 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.19e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
36 it=0 t=9.55e-15 dt=9.55e-16 int=148 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=1.58e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
37 it=0 t=1.27e-14 dt=1.27e-15 int=151 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.10e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
38 it=0 t=1.54e-14 dt=1.54e-15 int=153 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.65e+28 E=2.54e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
39 it=0 t=2.05e-14 dt=2.05e-15 int=156 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=3.37e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
40 it=0 t=2.72e-14 dt=2.72e-15 int=159 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=4.49e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
41 it=0 t=3.30e-14 dt=3.30e-15 int=161 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.64e+28 E=5.42e+14 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
42 it=0 t=4.39e-14 dt=4.39e-15 int=164 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.63e+28 E=7.20e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
43 it=0 t=5.84e-14 dt=5.84e-15 int=167 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.62e+28 E=9.57e+14 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
44 it=0 t=7.06e-14 dt=7.06e-15 int=169 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.62e+28 E=1.16e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
45 it=0 t=9.40e-14 dt=9.40e-15 int=172 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.60e+28 E=1.53e+15 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
46 it=0 t=1.25e-13 dt=1.25e-14 int=175 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.59e+28 E=2.03e+15 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
47 it=0 t=1.51e-13 dt=1.51e-14 int=177 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.58e+28 E=2.44e+15 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
48 it=0 t=2.02e-13 dt=2.02e-14 int=180 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.55e+28 E=3.22e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
49 it=0 t=2.68e-13 dt=2.68e-14 int=183 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.52e+28 E=4.24e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
50 it=0 t=3.25e-13 dt=3.25e-14 int=185 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.49e+28 E=5.09e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
51 it=0 t=4.32e-13 dt=4.32e-14 int=188 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.44e+28 E=6.65e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
52 it=0 t=5.75e-13 dt=5.75e-14 int=191 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.38e+28 E=8.66e+15 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
53 it=0 t=6.96e-13 dt=6.96e-14 int=193 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.33e+28 E=1.03e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
54 it=0 t=9.26e-13 dt=9.26e-14 int=196 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.24e+28 E=1.32e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
55 it=0 t=1.23e-12 dt=1.23e-13 int=199 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.14e+28 E=1.68e+16 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
56 it=0 t=1.49e-12 dt=1.49e-13 int=201 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.06e+28 E=1.96e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
57 it=0 t=1.99e-12 dt=1.99e-13 int=204 Asy=0/16 Eq=0/19 SX=1.0000 dE=9.29e+27 E=2.44e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
58 it=0 t=2.40e-12 dt=2.40e-13 int=206 Asy=0/16 Eq=0/19 SX=1.0000 dE=8.36e+27 E=2.80e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
59 it=0 t=3.20e-12 dt=3.20e-13 int=209 Asy=0/16 Eq=0/19 SX=1.0000 dE=6.89e+27 E=3.38e+16 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
60 it=0 t=4.26e-12 dt=4.26e-13 int=212 Asy=0/16 Eq=0/19 SX=1.0000 dE=5.44e+27 E=4.00e+16 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
61 it=0 t=5.15e-12 dt=5.15e-13 int=214 Asy=0/16 Eq=0/19 SX=1.0000 dE=4.50e+27 E=4.43e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
62 it=0 t=6.85e-12 dt=6.85e-13 int=217 Asy=0/16 Eq=0/19 SX=1.0000 dE=3.23e+27 E=5.04e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
63 it=0 t=9.12e-12 dt=9.12e-13 int=220 Asy=0/16 Eq=0/19 SX=1.0000 dE=2.14e+27 E=5.60e+16 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
64 it=0 t=1.10e-11 dt=1.10e-12 int=222 Asy=0/16 Eq=0/19 SX=1.0000 dE=1.54e+27 E=5.92e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
65 it=0 t=1.47e-11 dt=1.47e-12 int=225 Asy=0/16 Eq=0/19 SX=1.0000 dE=8.25e+26 E=6.30e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
66 it=0 t=1.96e-11 dt=1.96e-12 int=228 Asy=0/16 Eq=0/19 SX=1.0000 dE=3.23e+26 E=6.53e+16 E_R=4.44e-14 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
67 it=0 t=2.37e-11 dt=2.37e-12 int=230 Asy=0/16 Eq=0/19 SX=1.0000 dE=9.23e+25 E=6.58e+16 E_R=0.00e+00 ch=1 ch2=1 fast:c12+c12-->he4+ne20 Q=+4.621 dev=+0.000e+00
68 it=0 t=3.15e-11 dt=3.15e-12 int=233 Asy=0/16 Eq=0/19 SX=1.0000 dE=-1.25e+26 E=6.53e+16 E_R=4.44e-14 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
69 it=0 t=4.19e-11 dt=4.19e-12 int=236 Asy=0/16 Eq=0/19 SX=1.0000 dE=-2.21e+26 E=6.32e+16 E_R=4.44e-14 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
70 it=0 t=5.07e-11 dt=5.07e-12 int=238 Asy=0/16 Eq=0/19 SX=1.0000 dE=-2.34e+26 E=6.12e+16 E_R=0.00e+00 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
71 it=0 t=6.75e-11 dt=6.75e-12 int=241 Asy=0/16 Eq=0/19 SX=1.0000 dE=-2.01e+26 E=5.76e+16 E_R=0.00e+00 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
72 it=0 t=8.99e-11 dt=8.99e-12 int=244 Asy=0/16 Eq=0/19 SX=1.0000 dE=-1.31e+26 E=5.41e+16 E_R=0.00e+00 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
73 it=0 t=1.09e-10 dt=1.09e-11 int=246 Asy=0/16 Eq=0/19 SX=1.0000 dE=-7.85e+25 E=5.24e+16 E_R=4.44e-14 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
74 it=0 t=1.45e-10 dt=1.45e-11 int=249 Asy=0/16 Eq=0/19 SX=1.0000 dE=-5.93e+24 E=5.14e+16 E_R=4.44e-14 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
75 it=0 t=1.93e-10 dt=1.93e-11 int=252 Asy=0/16 Eq=0/19 SX=1.0000 dE=4.60e+25 E=5.29e+16 E_R=0.00e+00 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
76 it=0 t=2.33e-10 dt=2.33e-11 int=254 Asy=0/16 Eq=0/19 SX=1.0000 dE=6.71e+25 E=5.55e+16 E_R=0.00e+00 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
77 it=0 t=3.10e-10 dt=3.10e-11 int=257 Asy=0/16 Eq=0/19 SX=1.0000 dE=8.26e+25 E=6.16e+16 E_R=4.44e-14 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
78 it=0 t=4.13e-10 dt=4.13e-11 int=260 Asy=0/16 Eq=0/19 SX=1.0000 dE=8.68e+25 E=7.04e+16 E_R=4.44e-14 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
79 it=0 t=5.00e-10 dt=5.00e-11 int=262 Asy=0/16 Eq=0/19 SX=1.0000 dE=8.68e+25 E=7.79e+16 E_R=0.00e+00 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
80 it=0 t=6.65e-10 dt=6.65e-11 int=265 Asy=0/16 Eq=0/19 SX=1.0001 dE=8.45e+25 E=9.20e+16 E_R=1.43e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
81 it=0 t=8.85e-10 dt=8.85e-11 int=268 Asy=0/16 Eq=0/19 SX=1.0002 dE=7.95e+25 E=1.10e+17 E_R=2.04e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
82 it=0 t=1.07e-09 dt=1.07e-10 int=270 Asy=0/16 Eq=0/19 SX=1.0004 dE=7.44e+25 E=1.24e+17 E_R=2.41e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
83 it=0 t=1.43e-09 dt=1.43e-10 int=273 Asy=1/16 Eq=0/19 SX=1.0010 dE=6.39e+25 E=1.48e+17 E_R=1.69e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
84 it=0 t=1.90e-09 dt=1.90e-10 int=276 Asy=2/16 Eq=0/19 SX=1.0025 dE=5.15e+25 E=1.74e+17 E_R=4.59e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
85 it=0 t=2.30e-09 dt=2.30e-10 int=278 Asy=2/16 Eq=0/19 SX=1.0039 dE=4.29e+25 E=1.92e+17 E_R=5.54e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
Hardware watchpoint 1: Y[7]

Old value = 0.00061831295621857631
New value = 0.00071423486482885068
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=279 logt=-8.556314 logY[7]=-3.146159 equil= 0
Missing separate debuginfos, use: dnf debuginfo-install libgcc-9.2.1-1.fc30.x86_64 libstdc++-9.2.1-1.fc30.x86_64
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=2.5251871677599631e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=2.5251871677599631e-10, sumXX=1.0047786034544284) at explicitMatrix.cpp:3569
        dtt = 2.5251871677599631e-10
        dtt_0 = 3.4906990341519129e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 1.268179322292886e-20
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 5305693.9946900988
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 86
(gdb) p dtMode
$1 = -1
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.00071353983938225968
New value = 0.00081566341478299712
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=280 logt=-8.514921 logY[7]=-3.088489 equil= 0
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=2.7777058845359593e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=2.7777058845359593e-10, sumXX=1.0056980464219003) at explicitMatrix.cpp:3569
        dtt = 2.7777058845359593e-10
        dtt_0 = 3.4394404886541624e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 3.0216577124476793e-20
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 4709160.4058142379
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 86
(gdb) c
Continuing.

86 it=0 t=3.06e-09 dt=3.06e-10 int=281 Asy=2/16 Eq=0/19 SX=1.0067 dE=3.08e+25 E=2.18e+17 E_R=6.55e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
Hardware watchpoint 1: Y[7]

Old value = 0.00081448272746762558
New value = 0.00092135226412945795
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=281 logt=-8.473528 logY[7]=-3.035574 equil= 0
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.00091965089463173809
New value = 0.0010295458012666969
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=282 logt=-8.432136 logY[7]=-2.987354 equil= 0
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0010273161464594679
New value = 0.0011383439678200394
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=283 logt=-8.390743 logY[7]=-2.943726 equil= 0
(gdb) c
Continuing.

87 it=0 t=4.07e-09 dt=4.07e-10 int=284 Asy=2/16 Eq=0/19 SX=1.0101 dE=2.07e+25 E=2.42e+17 E_R=7.43e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
Hardware watchpoint 1: Y[7]

Old value = 0.0011356094959561751
New value = 0.0012458203092030821
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=284 logt=-8.349350 logY[7]=-2.904545 equil= 0
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0012426359174364588
New value = 0.0013501457218573483
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=285 logt=-8.307958 logY[7]=-2.869619 equil= 0
(gdb) c
Continuing.

88 it=0 t=4.92e-09 dt=4.92e-10 int=286 Asy=2/16 Eq=0/19 SX=1.0115 dE=1.56e+25 E=2.56e+17 E_R=4.08e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
Hardware watchpoint 1: Y[7]

Old value = 0.0013446957549056676
New value = 0.0014465301013042934
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=286 logt=-8.266565 logY[7]=-2.839673 equil= 0
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=4.920875414514408e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=4.920875414514408e-10, sumXX=1.0114988009354884) at explicitMatrix.cpp:3569
        dtt = 4.920875414514408e-10
        dtt_0 = 3.4189743594371594e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 3.7244737230553771e-18
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 1961721.5928784013
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 89
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0014409098495818738
New value = 0.0015365304558400427
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=287 logt=-8.225172 logY[7]=-2.813459 equil= 0
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0015306590621427176
New value = 0.0016194852108431998
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=288 logt=-8.183780 logY[7]=-2.790623 equil= 0
(gdb) c
Continuing.

89 it=0 t=6.55e-09 dt=6.55e-10 int=289 Asy=2/16 Eq=0/19 SX=1.0130 dE=9.71e+24 E=2.75e+17 E_R=2.05e-01 ch=0 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+0.000e+00
Hardware watchpoint 1: Y[7]

Old value = 0.0016134054386830144
New value = 0.0016950043131505937
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=289 logt=-8.142387 logY[7]=-2.770829 equil= 0
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=6.5496851767186779e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=6.5496851767186779e-10, sumXX=1.0130004521530316) at explicitMatrix.cpp:3569
        dtt = 6.5496851767186779e-10
        dtt_0 = 3.4654519370148998e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 3.1802734271457601e-17
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 1127819.5041892072
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 90
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0016887761024809017
New value = 0.001762954617571104
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=290 logt=-8.100994 logY[7]=-2.753759 equil= 0
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=7.2046536943905455e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=7.2046536943905455e-10, sumXX=1.0136317202277767) at explicitMatrix.cpp:3569
        dtt = 7.2046536943905455e-10
        dtt_0 = 3.5296503633054962e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 6.3494682061728373e-17
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 920885.12323943176
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 90
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0017566390308490845
New value = 0.001823467208848534
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=291 logt=-8.059602 logY[7]=-2.739102 equil= 0
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=7.9251190638296005e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=7.9251190638296005e-10, sumXX=1.014323396625364) at explicitMatrix.cpp:3569
        dtt = 7.9251190638296005e-10
        dtt_0 = 3.5607882429338964e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 1.2425706313041002e-16
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 744556.0775670656
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 90
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0018171094178463525
New value = 0.0017901227320984484
restoreEquilibriumProg () at explicitMatrix.cpp:4681
4681	        Y0[i] = Y[i];

gnu: steps=292 logt=-8.059602 logY[7]=-2.747117 equil= 1
(gdb) bt full
#0  restoreEquilibriumProg () at explicitMatrix.cpp:4681
        i = 7
        countConstraints = 1
        countEquilIsotopes = 3
        RGindy = {9, 1018566595, 4247938, 0, -2017980347, 1066224966, 1516591606, 1070401233, -10200, 32767, 4758800, 0, -10176, 32767, 4247187, 0, 847086358, 
          1022502912, 4757744}
        itcounter = 1
        sumXeq = 0.87048442428621908
        sumXNeq = 0.14459090282069362
        XcorrFac = 0.9851485631614364
#1  0x0000000000403151 in main () at explicitMatrix.cpp:4323
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 90
(gdb) p Xcorrfac
(gdb) p Xcorrfac[1PacFac
$2 = 0.9851485631614364
(gdb) c
Continuing.

90 it=0 t=8.72e-09 dt=8.72e-10 int=292 Asy=3/16 Eq=1/19 SX=1.0000 dE=5.51e+24 E=2.89e+17 E_R=8.81e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+1.431e-02
Hardware watchpoint 1: Y[7]

Old value = 0.0017901227320984484
New value = 0.0018301767342332564
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=292 logt=-8.018209 logY[7]=-2.737507 equil= 1
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=8.7176309702125608e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=8.7176309702125608e-10, sumXX=1) at explicitMatrix.cpp:3569
        dtt = 8.7176309702125608e-10
        dtt_0 = 3.4678233534006218e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 2.2837349582770714e-16
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 605445.31140800798
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 91
(gdb) p i
$3 = 7
(gdb) p Y[i]
$4 = 0.0018301767342332564
(gdb) p Y0[i]
$5 = 0.0017901227320984484
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0018220609438312962
New value = 0.0018194801714041021
restoreEquilibriumProg () at explicitMatrix.cpp:4681
4681	        Y0[i] = Y[i];

gnu: steps=293 logt=-8.018209 logY[7]=-2.740053 equil= 1
(gdb) cp Y0[i][1P[i]i[Kbt fullc[Kp XcorrFac
$6 = 0.99858359708772004
(gdb) p XcorrFac[C[C[C[C[C[Cc[K
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0018194801714041021
New value = 0.0018336722173894545
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=293 logt=-7.976816 logY[7]=-2.736678 equil= 1
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=9.5893940672338173e-10) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=9.5893940672338173e-10, sumXX=1.0000000000000002) at explicitMatrix.cpp:3569
        dtt = 9.5893940672338173e-10
        dtt_0 = 3.4488318577666097e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 3.8867933258303393e-16
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 517326.86388367135
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 91
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0018311191110177987
New value = 0.0018284679884786222
restoreEquilibriumProg () at explicitMatrix.cpp:4681
4681	        Y0[i] = Y[i];

gnu: steps=294 logt=-7.976816 logY[7]=-2.737913 equil= 1
(gdb) cbt fullc[Kp XcorrFac
$7 = 0.99855218455029782
(gdb) bt full
#0  restoreEquilibriumProg () at explicitMatrix.cpp:4681
        i = 7
        countConstraints = 1
        countEquilIsotopes = 0
        RGindy = {9, 1020442243, 4222058, 15, -10184, 32767, 4277608, 0, -10200, 32767, 4758800, 0, -10176, 32767, 4247187, 0, -1451843292, 1022074878, 4757744}
        itcounter = 1
        sumXeq = 0.86977435374220491
        sumXNeq = 0.13167556091634067
        XcorrFac = 0.99855218455029782
#1  0x0000000000403151 in main () at explicitMatrix.cpp:4323
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 91
(gdb) c
Continuing.

91 it=0 t=1.05e-08 dt=1.05e-09 int=294 Asy=4/16 Eq=1/19 SX=1.0000 dE=1.84e+24 E=2.93e+17 E_R=8.92e-02 ch=1 ch2=1 fast:ne20-->he4+o16 Q=-4.734 dev=+7.760e-02
Hardware watchpoint 1: Y[7]

Old value = 0.0018284679884786222
New value = 0.0018329802163386808
Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
3685	                X[i] = Y[i] * (double) AA[i];

gnu: steps=294 logt=-7.935423 logY[7]=-2.736842 equil= 1
(gdb) bt full
#0  Integrate::updateAsyEuler () at explicitMatrix.cpp:3685
        i = 7
#1  0x000000000040da20 in Integrate::updatePopulations (dtt=1.0548333473957199e-09) at explicitMatrix.cpp:3663
        numAsy = 0
#2  0x000000000040d740 in Integrate::computeTimeStep_EA (dt0=1.0548333473957199e-09, sumXX=0.99999999999999989) at explicitMatrix.cpp:3569
        dtt = 1.0548333473957199e-09
        dtt_0 = 3.5660498508092942e-313
#3  0x000000000040d486 in Integrate::doIntegrationStep () at explicitMatrix.cpp:3457
        sumXhalf = 6.9533558073361956e-310
        sumXfull = 6.8715666649545843e-16
        dt_half = 6.9533558073361956e-310
        dE_half1 = 2.0806211053421576e-317
        dE_half2 = 411786.30172007019
        E_half1 = 0
        E_half2 = 0
        sumhalves = 3.3951932691017084e-313
#4  0x000000000040300d in main () at explicitMatrix.cpp:4286
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 92
(gdb) p isAsy[i]
$8 = false
(gdb) p FplusSum[i]
$9 = 1594304.1040844591
(gdb) p Fminis[K[KusSum[i]
$10 = 1590026.4351321086
(gdb) pY0[i] Y0[i]
$11 = 0.0018284679884786222
(gdb) p Y[i]
$12 = 0.0018329802163386808
(gdb) p Flux[31]
$13 = 1467035.043006419
(gdb) p Flux[31][1P]0]
$14 = 1532072.0269348216
(gdb) p Flux[30][1P]2]
$15 = 122991.39212568967
(gdb) p Flux[32][1P]3]
$16 = 62232.077149637589
(gdb) p sumX
$17 = 0.91346594925789848
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0018324449340088378
New value = 0.0018296694977092197
restoreEquilibriumProg () at explicitMatrix.cpp:4681
4681	        Y0[i] = Y[i];

gnu: steps=295 logt=-7.935423 logY[7]=-2.737627 equil= 1
(gdb) bt full
#0  restoreEquilibriumProg () at explicitMatrix.cpp:4681
        i = 7
        countConstraints = 1
        countEquilIsotopes = 0
        RGindy = {9, 1021412021, 4222058, 15, -10184, 32767, 4277608, 0, -10200, 32767, 4758800, 0, -10176, 32767, 4247187, 0, -2098602623, 1021476861, 4757744}
        itcounter = 1
        sumXeq = 0.8744080040867781
        sumXNeq = 0.12710890172768344
        XcorrFac = 0.99848539170366979
#1  0x0000000000403151 in main () at explicitMatrix.cpp:4323
        networkFilePtr = 0x4141c0 <networkFile> "data/network_alpha.inp"
        rateLibraryFilePtr = 0x4141e0 <rateLibraryFile> "data/rateLibrary_alpha.data"
        plotCounter = 92
(gdb) c
Continuing.

Hardware watchpoint 1: Y[7]

Old value = 0.0018296694977092197
New value = 0.0018298374843646094
0x000000000040dad0 in Integrate::updateAsyEuler () at explicitMatrix.cpp:3681
3681	                    Y[i] = asymptoticUpdate(i, FplusSum[i], FminusSum[i], Y0[i], dt);

gnu: steps=295 logt=-7.894031 logY[7]=-2.737587 equil= 1
(gdb) 